blog/app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "name", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "mllfdkdsll;kegdf;bvhmkm"], ["created_at", Wed, 06 Mar 2013 23:24:30 UTC +00:00], ["name", "sama"], ["title", "lkesf'l"], ["updated_at", Wed, 06 Mar 2013 23:24:30 UTC +00:00]]
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "posts" SET "content" = 'dsfl;ke;sdflfewf', "updated_at" = '2013-03-08 04:26:10.057605' WHERE "posts"."id" = 4
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])